## 2. SQL Basic Queries


### 2.1 Aliasing 

For brevity and/or clarity we rename columns using aliasing.

```
SELECT name AS first_name, surname
FROM customers;
```


### 2.2 Selecting distinct records

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

Get a list of a field with no repeat values use:

```
SELECT DISTINCT year
FROM customers;
```

### 2.3 Count

The `COUNT()` function returns the total number of `non-missing` rows in one or more columns.

```
# Return number of rows in the customers table.
SELECT COUNT(*)
FROM customers;
```

`COUNT(*)` tells you how many rows are in a table, including missing values in particular columns. However, if you want to count the number of non-missing values in a particular column, you can call `COUNT()` on just that column.

```
# Count the number of birth dates present in the customers table:
SELECT COUNT(birthdate)
FROM customers;

# Count the number of distinct birth dates present in the customers table:
SELECT COUNT(DISTINCT birthdate)
FROM customers;
```

### 2.3 Filtering


#### 2.3.1 `WHERE` clause
In SQL, the `WHERE` keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

* `=` equal
* `<>` not equal
* `<` less than
* `>` greater than
* `<=` less than or equal to
* `>=` greater than or equal to

For example, you can filter records based on criteria such as age. The following code returns all customers with age `30`:

```
# All records for customers age 30
SELECT *
FROM customers
WHERE age = 30;

# Number of customers above the age of 30
SELECT COUNT(*)
FROM films
WHERE age > 30;
```
Notice that the `WHERE` clause always comes after the `FROM` statement.

The `WHERE` clause can also be used to filter text results, such as names or countries.

For example, this query gets the customers which were located in China:
```
SELECT *
FROM films
WHERE country = 'China';
```
*Important: in PostgreSQL (the version of SQL we're using), you must use single quotes with WHERE.*


#### 2.3.2 `WHERE AND` clause

To select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.


```
# All records for customers in China and 30 years of age
SELECT *
FROM customers
WHERE age = 30
AND country = 'China';
```

Note that 
- you need to specify the column name separately for every `AND` condition
- you can add as many AND conditions as you need

#### 2.3.3 `WHERE AND OR` clause

SQL has the `OR` operator in order to select rows based on multiple conditions where some but not all of the conditions need to be met.

```
SELECT *
FROM customers
WHERE country = 'China' 
OR country = 'Taiwan'
```

 - you need to specify the column for every OR condition
 - when combining `AND` and `OR`, be sure to enclose the individual clauses in parentheses

```
SELECT name
FROM customers
WHERE (country = 'China' OR country = 'Taiwan')
AND (age = 30 OR age = 40);
```


#### 2.3.4 `BETWEEN` clause

Checking for ranges is very common, so in SQL the `BETWEEN` keyword provides a useful shorthand for filtering values within a specified range. 
```
# Number of customers between 30 and 40 years of age
SELECT COUNT(*)
FROM films
WHERE age > 30 
AND age <= 40;

# Same result as above with different expression
SELECT COUNT(*)
FROM films
WHERE age 
BETWEEN 30 AND 40;
```
`BETWEEN` is inclusive, meaning the beginning and end values are included in the results.

#### 2.3.4 `WHERE IN` clause

WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy. For example:

```
SELECT name
FROM customers
WHERE age = 20
OR age = 40
OR age = 60
OR age = 80
OR age = 100;
```
The `IN` operator allows to specify multiple values in a `WHERE` clause, making it easier and quicker to specify multiple OR conditions.

```
SELECT name
FROM customers
WHERE age IN (20, 40, 60, 80, 100);
```

#### 2.3.5 `NULL` and `IS NULL`

In SQL, `NULL` represents a missing or unknown value. You can check for `NULL` values using the expression `IS NULL`. For example, to count the number of missing age values in the customers table:

``` 
SELECT COUNT(*)
FROM customers
WHERE age IS NULL;
```
To filter out missing values so you only get results which are not NULL, you can use the IS `IS NOT NULL` operator.


``` 
SELECT COUNT(*)
FROM customers
WHERE age IS NOT NULL;
```


#### 2.3.6 `LIKE` and `NOT LIKE`

To search for a pattern rather than a specific text string. The `LIKE` operator can be used in a `WHERE` clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with `LIKE`:

- The `%` wildcard will match zero, one, or many characters in text. For example, the following query matches countries like 'China', 'Columbia' 'Canada' and so on: \
```
SELECT *
FROM customers
WHERE country LIKE 'C%';
```

- The `_` wildcard will match a single character. For example, the following query matches countries whose names have 'r' as the second letter like 'Greece', 'SriLanka', and so on:
```
SELECT name
FROM companies
WHERE name LIKE '_r';
```

You can also use the `NOT LIKE` operator to find records that don't match the pattern you specify.

> ❗️The `%` and `_` wildcards work only in combination with the `LIKE` clause.


## 2.4 Views

- A view is a virtual table that is the result of a saved SQL `SELECT` statement.
- A virtual table is not stored in the database but rather the Query code that is stored for future use.
- When accessed, views automatically update in response to updates in the underlying data.

```
CREATE VIEW customer_purchase_year AS
SELECT id, name, year_purchased
FROM customers;
```

Once created, we can query a virtual table just as we would a normal table by selecting `FROM` the view.